#+TITLE: Emacs Config
#+AUTHOR: Dan Barbarito

** latex
   #+BEGIN_SRC emacs-lisp
     (setq tex-compile-commands '(("xelatex %r")))
     (setq tex-command "xelatex")
     (setq-default TeX-engine 'xelatex)

     (setq org-latex-pdf-process
           '("xelatex -interaction nonstopmode -output-directory %o %f"
             "xelatex -interaction nonstopmode -output-directory %o %f"
             "xelatex -interaction nonstopmode -output-directory %o %f"))

     (setq locate-command "mdfind")
     (setenv "PATH" (concat (getenv "PATH") ":/usr/local/share/npm/bin:/usr/local/bin:/usr/texbin"))
     (setq exec-path (append exec-path '("/usr/local/bin" "~/.rbenv/shims" "/usr/texbin")))
   #+END_SRC

   #+RESULTS:
   | /usr/bin | /bin | /usr/sbin | /sbin | /usr/local/Cellar/emacs/24.5/libexec/emacs/24.5/x86_64-apple-darwin14.3.0 | /usr/local/bin | /usr/texbin | /usr/local/bin | ~/.rbenv/shims | /usr/texbin |

*** Clocking
    #+BEGIN_SRC emacs-lisp
      (setq org-clock-persist 'history)
      (org-clock-persistence-insinuate)
    #+END_SRC

    #+RESULTS:
    | org-clock-save | ensime-kill-emacs-hook-function | recentf-save-list | pcache-kill-emacs-hook | ido-kill-emacs-hook | flycheck-global-teardown | bookmark-exit-hook-internal | company-clang-set-prefix | server-force-stop | org-babel-remove-temporary-directory |

*** org-deck
    #+BEGIN_SRC emacs-lisp
      (setq org-deck-base-url "https://blog.oyanglul.us/deck.js")
      (setq org-deck-theme "web-2.0.css")
      (setq org-deck-transition "horizontal-slide.css")
      (setq org-deck-postamble "<p>%t - %a</p>")
    #+END_SRC

    #+RESULTS:
    : <p>%t - %a</p>

*** pandoc
    #+BEGIN_SRC emacs-lisp
      (setq org-pandoc-options-for-revealjs '(
                                              (self-contained . t)
                                              (variable . "theme=solarized")
                                              (section-divs . t)
                                              (standalone . nil)))
    #+END_SRC

    #+RESULTS:
    : ((self-contained . t) (variable . theme=solarized) (section-divs . t) (standalone))

** smartparens

   #+BEGIN_SRC emacs-lisp
     (require 'smartparens-config)
     (smartparens-global-mode t)

     (show-smartparens-global-mode t)
   #+END_SRC

   #+RESULTS:
   | turn-on-smartparens-strict-mode |
** general
   #+BEGIN_SRC emacs-lisp 
     (bind-keys
      ("M-c" . kill-ring-save)
      ("C-8" . er/expand-region)
      ("M-8" . er/contract-region)
      ("C-x r" . vr/query-replace)
      ("M--" . text-scale-decrease)
      ("M-=" . text-scale-increase)
      ("C-c i" . (lambda () (interactive) (indent-region (point-min) (point-max))))
      ("M-<backspace>" . kill-whole-line)
      ("C-c r" . revert-buffer)
      ("C-3" . back-button-global-backward)
      ("C-4" . back-button-global-forward)
      ("C-c f" . ace-jump-mode)
      ("M-k" . delete-other-windows)
      ("<f7>" . toggle-window-split)
      ("C-c c" . deft)
      ("C-c t" . eshell)
      ("C-S-s" . replace-string)
      ("C-x t" . org-capture)
      ("C-c a" . org-agenda)
      ("C-x C-b" . ibuffer)
      ("C-x w" . ack)
      ("S-C-<left>" . shrink-window-horizontally)
      ("S-C-<left>" . shrink-window-horizontally)
      ("S-C-<right>" . enlarge-window-horizontally)
      ("S-C-<down>" . shrink-window)
      ("S-C-<up>" . enlarge-window))

   #+END_SRC  

   #+RESULTS:
   | lambda | nil | (interactive) | (org-agenda nil n) |

